apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_ssi_type.h
/**************************************************************************//**
 * @file      rtl8710c_ssi_type.h
 * @brief
 * @version   V1.00
 * @date      2018-1-4 15:41:32
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 ******************************************************************************/

#ifndef _RTL8710C_SSI_TYPE_H_
#define _RTL8710C_SSI_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SSI_REG_TYPE

/**
 * @addtogroup hs_hal_ssi_reg SSI Registers.
 * @ingroup hs_hal_ssi
 * @{
 */

/**
  \brief Union type to access ssi_ctrlr0 (@ 0x00000000).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000000) SSI Control Register 0                                     */
  
  struct {
    __IOM uint32_t dfs        : 4;            /*!< [3..0] Data frame size                                                    */
    __IOM uint32_t frf        : 2;            /*!< [5..4] Frame format                                                       */
    __IOM uint32_t scph       : 1;            /*!< [6..6] Serial Clock Phase. Valid when the frame format (FRF)
                                                   is set to Motorola SPI. The serial clock phase selects
                                                   the relationship of the serial clock with the slave select
                                                   signal. When SCPH = 0, data are captured on the first edge
                                                   of the serial clock. When SCPH = 1, the serial clock starts
                                                   toggling one cycle after the slave select line is activated,
                                                   and data are captured on the second edge of the serial
                                                   clock. 0: Serial clock toggles in middle of first data
                                                   bit 1: Serial clock toggles at start of first data bi                     */
    __IOM uint32_t scpol      : 1;            /*!< [7..7] Serial Clock Polarity. Valid when the frame format (FRF)
                                                   is set to Motorola SPI. Used to select the polarity of
                                                   the inactive serial clock, which is held inactive when
                                                   the DW_apb_ssi master is not actively transferring data
                                                   on the serial bus. 0 : Inactive state of serial clock is
                                                   low 1 : Inactive state of serial clock is high                            */
    __IOM uint32_t tmod       : 2;            /*!< [9..8] Transfer mode                                                      */
    __IOM uint32_t slv_oe     : 1;            /*!< [10..10] Slave ouput enable. Relevant only when the device is
                                                   a slave                                                                   */
    __IM  uint32_t            : 1;
    __IOM uint32_t cfs        : 4;            /*!< [15..12] Control frame size for Microwire frame format                    */
    __IM  uint32_t            : 5;
    __IOM uint32_t tx_byte_swap : 1;          /*!< [21..21] Reverse every transmit byte                                      */
    __IOM uint32_t tx_bit_swap : 1;           /*!< [22..22] Reverse every transmit bit                                       */
    __IOM uint32_t rx_byte_swap : 1;          /*!< [23..23] Reverse every received byte                                      */
    __IOM uint32_t rx_bit_swap : 1;           /*!< [24..24] Reverse every received bit                                       */
    __IM  uint32_t            : 6;
    __IOM uint32_t ss_t       : 1;            /*!< [31..31] SSI master chooses to toggle between successive frames
                                                   or not.                                                                   */
  } b;                                        /*!< bit fields for ssi_ctrlr0 */
} ssi_ctrlr0_t, *pssi_ctrlr0_t;

/**
  \brief Union type to access ssi_ctrlr1 (@ 0x00000004).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000004) SSI Control Register 1                                     */
  
  struct {
    __IOM uint32_t ndf        : 16;           /*!< [15..0] Number of data frame. Only valid when SSI device is
                                                   a master                                                                  */
  } b;                                        /*!< bit fields for ssi_ctrlr1 */
} ssi_ctrlr1_t, *pssi_ctrlr1_t;

/**
  \brief Union type to access ssi_ssienr (@ 0x00000008).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000008) SSI Enable Register                                        */
  
  struct {
    __IOM uint32_t ssi_en     : 1;            /*!< [0..0] SSI Enable. Enables and disables all DW_apb_ssi operations.
                                                   When disabled, all serial transfers are halted immediately.
                                                   Transmit and receive FIFO buffers are cleared when the
                                                   device is disabled. It is impossible to program some of
                                                   the DW_apb_ssi control registers when enabled. When disabled,
                                                   the ssi_sleep output is set (after delay) to inform the
                                                   system that it is safe to remove the ssi_clk, thus saving
                                                   power consumption in the system                                           */
  } b;                                        /*!< bit fields for ssi_ssienr */
} ssi_ssienr_t, *pssi_ssienr_t;

/**
  \brief Union type to access ssi_mwcr (@ 0x0000000C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000000C) Microwire Control Register                                 */
  
