apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_ssi_type.h
  struct {
    __IOM uint32_t mwmod      : 1;            /*!< [0..0] Microwire Transfer Mode. Defines the transfer is sequential
                                                   or not.                                                                   */
    __IOM uint32_t mdd        : 1;            /*!< [1..1] Microwire Control. Defines the direction of the data
                                                   word when the Microwire serial protocol is used.                          */
    __IOM uint32_t mhs        : 1;            /*!< [2..2] Microwire Handshaking. Only valide when SSI device is
                                                   a slave.                                                                  */
  } b;                                        /*!< bit fields for ssi_mwcr */
} ssi_mwcr_t, *pssi_mwcr_t;

/**
  \brief Union type to access ssi_ser (@ 0x00000010).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000010) Slave Enable Register                                      */
  
  struct {
    __IOM uint32_t ser        : 8;            /*!< [7..0] This register is only valid when the device is configured
                                                   as a master device. It is used to select which slave devices
                                                   it would like to communicate with.                                        */
  } b;                                        /*!< bit fields for ssi_ser */
} ssi_ser_t, *pssi_ser_t;

/**
  \brief Union type to access ssi_baudr (@ 0x00000014).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000014) Baud Rate Select Register                                  */
  
  struct {
    __IOM uint32_t sckdv      : 16;           /*!< [15..0] This register is only valid when the device is configured
                                                   as a master device. It is used to change the operating
                                                   frequency of SPI device.                                                  */
  } b;                                        /*!< bit fields for ssi_baudr */
} ssi_baudr_t, *pssi_baudr_t;

/**
  \brief Union type to access ssi_txftlr (@ 0x00000018).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000018) Transmit FIFO Threshold Level                              */
  
  struct {
    __IOM uint32_t tft        : 8;            /*!< [7..0] Transmit FIFO Threshold. Controls the level of entries
                                                   (or below) at which the transmit FIFO controller triggers
                                                   an interrupt.                                                             */
  } b;                                        /*!< bit fields for ssi_txftlr */
} ssi_txftlr_t, *pssi_txftlr_t;

/**
  \brief Union type to access ssi_rxftlr (@ 0x0000001C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000001C) Receive FIFO Threshold Level                               */
  
  struct {
    __IOM uint32_t rft        : 8;            /*!< [7..0] Receive FIFO Threshold. Controls the level of entries
                                                   (or above) at which the receive FIFO controller triggers
                                                   an interrupt.                                                             */
  } b;                                        /*!< bit fields for ssi_rxftlr */
} ssi_rxftlr_t, *pssi_rxftlr_t;

/**
  \brief Union type to access ssi_txflr (@ 0x00000020).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000020) Transmit FIFO Level Register                               */
  
  struct {
    __IM  uint32_t txtfl      : 8;            /*!< [7..0] Transmit FIFO Level. Contains the number of valid data
                                                   entries in the transmit FIFO.                                             */
  } b;                                        /*!< bit fields for ssi_txflr */
} ssi_txflr_t, *pssi_txflr_t;

/**
  \brief Union type to access ssi_rxflr (@ 0x00000024).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000024) Receive FIFO Level Register                                */
  
  struct {
    __IM  uint32_t rxtfl      : 8;            /*!< [7..0] Receive FIFO Level. Contains the number of valid data
                                                   entries in the receive FIFO.                                              */
  } b;                                        /*!< bit fields for ssi_rxflr */
} ssi_rxflr_t, *pssi_rxflr_t;

/**
  \brief Union type to access ssi_sr (@ 0x00000028).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000028) Status Register                                            */
  
  struct {
    __IM  uint32_t busy       : 1;            /*!< [0..0] SSI Busy Flag. When set, indicates that a serial transfer
                                                   is in progress; when cleared indicates that the DW_apb_ssi
                                                   is idle or disabled.                                                      */
    __IM  uint32_t tfnf       : 1;            /*!< [1..1] Transmit FIFO Not Full. Set when the transmit FIFO contains
                                                   one or more empty locations, and is cleared when the FIFO
                                                   is full. 0 : Transmit FIFO is full 1 : Transmit FIFO is
                                                   not full                                                                  */
    __IM  uint32_t tfe        : 1;            /*!< [2..2] Transmit FIFO Empty. When the transmit FIFO is completely
                                                   empty, this bit is set. When the transmit FIFO contains
                                                   one or more valid entries, this bit is cleared. This bit
                                                   field does not request an interrupt. 0 : Transmit FIFO
                                                   is not empty 1 : Transmit FIFO is empty                                   */
    __IM  uint32_t rfne       : 1;            /*!< [3..3] Receive FIFO Not Empty. Set when the receive FIFO contains
                                                   one or more entries and is cleared when the receive FIFO
                                                   is empty. This bit can be polled by software to completely
                                                   empty the receive FIFO. 0 : Receive FIFO is empty 1 : Receive
                                                   FIFO is not empty                                                         */
    __IM  uint32_t rff        : 1;            /*!< [4..4] Receive FIFO Full. When the receive FIFO is completely
                                                   full, this bit is set. When the receive FIFO contains one
                                                   or more empty location, this bit is cleared. 0 : Receive
                                                   FIFO is not full 1 : Receive FIFO is full                                 */
    __IM  uint32_t txe        : 1;            /*!< [5..5] Transmission Error. Set if the transmit FIFO is empty
                                                   when a transfer is started. This bit can be set only when
                                                   the DW_apb_ssi is configured as a slave device. Data from
                                                   the previous transmission is resent on the txd line. This
                                                   bit is cleared when read. 0 : No error 1 : Transmission
                                                   error                                                                     */
  } b;                                        /*!< bit fields for ssi_sr */
} ssi_sr_t, *pssi_sr_t;

/**
  \brief Union type to access ssi_imr (@ 0x0000002C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000002C) Interrupt Mask Register                                    */
  
