apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_ssi_type.h
  struct {
    __IOM uint32_t txeim      : 1;            /*!< [0..0] Transmit FIFO Empty Interrupt Mask 0 : ssi_txe_intr interrupt
                                                   is masked 1 : ssi_txe_intr interrupt is not masked                        */
    __IOM uint32_t txoim      : 1;            /*!< [1..1] Transmit FIFO Overflow Interrupt Mask 0 : ssi_txo_intr
                                                   interrupt is masked 1 : ssi_txo_intr interrupt is not masked              */
    __IOM uint32_t rxuim      : 1;            /*!< [2..2] Receive FIFO Underflow Interrupt Mask 0 : ssi_rxu_intr
                                                   interrupt is masked 1 : ssi_rxu_intr interrupt is not masked              */
    __IOM uint32_t rxoim      : 1;            /*!< [3..3] Receive FIFO Overflow Interrupt Mask 0 : ssi_rxo_intr
                                                   interrupt is masked 1 : ssi_rxo_intr interrupt is not masked              */
    __IOM uint32_t rxfim      : 1;            /*!< [4..4] Receive FIFO Full Interrupt Mask 0 : ssi_rxf_intr interrupt
                                                   is masked 1 : ssi_rxf_intr interrupt is not masked                        */
    __IOM uint32_t mstim      : 1;            /*!< [5..5] Multi-Master Contention Interrupt Mask. This bit field
                                                   is not present if the deice is a slave. 0 : ssi_mst_intr
                                                   interrupt is masked 1 : ssi_mst_intr interrupt is not masked              */
    __IOM uint32_t txuim      : 1;            /*!< [6..6] Transmit FIFO Under Flow Interrupt Status. Should not
                                                   be set when the device is a master and not under SPI mode.
                                                   0 : ssi_txu_intr interrupt is masked 1 : ssi_txu_intr interrupt
                                                   is not masked                                                             */
    __IOM uint32_t ssrim      : 1;            /*!< [7..7] SS_N Rising Edge Detect Interrupt Mask 0 : ssi_ssr_intr
                                                   interrupt is masked 1 : ssi_ssr_intr interrupt is not masked              */
  } b;                                        /*!< bit fields for ssi_imr */
} ssi_imr_t, *pssi_imr_t;

/**
  \brief Union type to access ssi_isr (@ 0x00000030).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000030) Interrupt Status Register                                  */
  
  struct {
    __IM  uint32_t txeis      : 1;            /*!< [0..0] Transmit FIFO Empty Interrupt Status 0 = ssi_txe_intr
                                                   interrupt is not active after masking 1 = ssi_txe_intr
                                                   interrupt is active after masking                                         */
    __IM  uint32_t txois      : 1;            /*!< [1..1] Transmit FIFO Overflow Interrupt Status 0 = ssi_txo_intr
                                                   interrupt is not active after masking 1 = ssi_txo_intr
                                                   interrupt is active after masking                                         */
    __IM  uint32_t rxuis      : 1;            /*!< [2..2] Receive FIFO Underflow Interrupt Status 0 = ssi_rxu_intr
                                                   interrupt is not active after masking 1 = ssi_rxu_intr
                                                   interrupt is active after masking                                         */
    __IM  uint32_t rxois      : 1;            /*!< [3..3] Receive FIFO Overflow Interrupt Status 0 = ssi_rxo_intr
                                                   interrupt is not active after masking 1 = ssi_rxo_intr
                                                   interrupt is active after masking                                         */
    __IM  uint32_t rxfis      : 1;            /*!< [4..4] Receive FIFO Full Interrupt Status 0 = ssi_rxf_intr interrupt
                                                   is not active after masking 1 = ssi_rxf_intr interrupt
                                                   is full after masking                                                     */
    __IM  uint32_t mstis      : 1;            /*!< [5..5] Multi-Master Contention Interrupt. This bit field is
                                                   not present if the deice is a slave. 0 = ssi_mst_intr interrupt
                                                   not active after masking 1 = ssi_mst_intr interrupt is
                                                   active after masking                                                      */
    __IM  uint32_t txuis      : 1;            /*!< [6..6] Transmit FIFO Under Flow Interrupt Status 0 = ssi_txu_intr
                                                   interrupt is not active after masking 1 = ssi_txu_intr
                                                   interrupt is active after masking                                         */
    __IM  uint32_t ssris      : 1;            /*!< [7..7] SS_N Rising Edge Detect Interrupt Status 0 = ssi_ssr_intr
                                                   interrupt is not active after masking 1 = ssi_ssr_intr
                                                   interrupt is active after masking                                         */
  } b;                                        /*!< bit fields for ssi_isr */
} ssi_isr_t, *pssi_isr_t;

/**
  \brief Union type to access ssi_risr (@ 0x00000034).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000034) Raw Interrupt Status Register                              */
  
  struct {
    __IM  uint32_t txeir      : 1;            /*!< [0..0] Transmit FIFO Empty Raw Interrupt Status 0 = ssi_txe_intr
                                                   interrupt is not active prior to masking 1 = ssi_txe_intr
                                                   interrupt is active prior to masking                                      */
    __IM  uint32_t txoir      : 1;            /*!< [1..1] Transmit FIFO Overflow Raw Interrupt Status 0 = ssi_txo_intr
                                                   interrupt is not active prior to masking 1 = ssi_txo_intr
                                                   interrupt is active prior to masking                                      */
    __IM  uint32_t rxuir      : 1;            /*!< [2..2] Receive FIFO Underflow Raw Interrupt Status 0 = ssi_rxu_intr
                                                   interrupt is not active prior to masking 1 = ssi_rxu_intr
                                                   interrupt is active prior to masking                                      */
    __IM  uint32_t rxoir      : 1;            /*!< [3..3] Receive FIFO Overflow Raw Interrupt Status 0 = ssi_rxo_intr
                                                   interrupt is not active prior to masking 1 = ssi_rxo_intr
                                                   interrupt is active prior to masking                                      */
    __IM  uint32_t rxfir      : 1;            /*!< [4..4] Receive FIFO Full Raw Interrupt Status 0 = ssi_rxf_intr
                                                   interrupt is not active prior to masking 1 = ssi_rxf_intr
                                                   interrupt is full prior to masking                                        */
    __IM  uint32_t mstir      : 1;            /*!< [5..5] Multi-Master Contention Raw Interrupt Status. This bit
                                                   field is not present if the deice is a slave. 0 = ssi_mst_intr
                                                   interrupt not active prior to masking 1 = ssi_mst_intr
                                                   interrupt is active prior to masking                                      */
    __IM  uint32_t txuir      : 1;            /*!< [6..6] Transmit FIFO Under Flow Raw Interrupt Status 0 = ssi_txu_intr
                                                   interrupt is not active prior to masking 1 = ssi_txu_intr
                                                   interrupt is active prior to masking                                      */
    __IM  uint32_t ssrir      : 1;            /*!< [7..7] SS_N Rising Edge Detect Raw Interrupt Status 0 = ssi_ssr_intr
                                                   interrupt is not active prior to masking 1 = ssi_ssr_intr
                                                   interrupt is active prior to masking                                      */
  } b;                                        /*!< bit fields for ssi_risr */
} ssi_risr_t, *pssi_risr_t;

/**
  \brief Union type to access ssi_txoicr (@ 0x00000038).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000038) Transmit FIFO Overflow Interrupt Clear Register            */
  
