apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_ssi_type.h
  struct {
    __IM  uint32_t txoicr     : 1;            /*!< [0..0] Clear Transmit FIFO Overflow Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_txo_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for ssi_txoicr */
} ssi_txoicr_t, *pssi_txoicr_t;

/**
  \brief Union type to access ssi_rxoicr (@ 0x0000003C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register             */
  
  struct {
    __IM  uint32_t rxoicr     : 1;            /*!< [0..0] Clear Receive FIFO Overflow Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_rxo_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for ssi_rxoicr */
} ssi_rxoicr_t, *pssi_rxoicr_t;

/**
  \brief Union type to access ssi_rxuicr (@ 0x00000040).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register            */
  
  struct {
    __IM  uint32_t rxuicr     : 1;            /*!< [0..0] Clear Receive FIFO Underflow Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_rxu_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for ssi_rxuicr */
} ssi_rxuicr_t, *pssi_rxuicr_t;

/**
  \brief Union type to access ssi_msticr (@ 0x00000044).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000044) Multi-Master Interrupt Clear Register                      */
  
  struct {
    __IM  uint32_t msticr     : 1;            /*!< [0..0] Clear Multi-Master Contention Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_mst_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for ssi_msticr */
} ssi_msticr_t, *pssi_msticr_t;

/**
  \brief Union type to access ssi_icr (@ 0x00000048).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000048) Interrupt Clear Register                                   */
  
  struct {
    __IM  uint32_t icr        : 1;            /*!< [0..0] Clear Interrupts. This register is set if any of the
                                                   interrupts below are active. A read clears the ssi_txu_intr,
                                                   ssi_txo_intr, ssi_rxu_intr, ssi_rxo_intr, and ssi_ssr_intr
                                                   interrupts. Writing to this register has no effect.                       */
  } b;                                        /*!< bit fields for ssi_icr */
} ssi_icr_t, *pssi_icr_t;

/**
  \brief Union type to access ssi_dmacr (@ 0x0000004C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000004C) DMA Control Register                                       */
  
  struct {
    __IOM uint32_t rdmae      : 1;            /*!< [0..0] Receive DMA Enable. This bit enables/disables the receive
                                                   FIFO DMA channel 0 : Receive DMA disabled 1 : Receive DMA
                                                   enabled                                                                   */
    __IOM uint32_t tdmae      : 1;            /*!< [1..1] Transmit DMA Enable. This bit enables/disables the transmit
                                                   FIFO DMA channel. 0 : Transmit DMA disabled 1 : Transmit
                                                   DMA enabled                                                               */
  } b;                                        /*!< bit fields for ssi_dmacr */
} ssi_dmacr_t, *pssi_dmacr_t;

/**
  \brief Union type to access ssi_dmatdlr (@ 0x00000050).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000050) DMA Transmit Data Level Register                           */
  
  struct {
    __IOM uint32_t dmatdl     : 8;            /*!< [7..0] Transmit Data Level. This bit field controls the level
                                                   at which a DMA request is made by the transmit logic. It
                                                   is equal to the watermark level; that is, the dma_tx_req
                                                   signal is generated when the number of valid data entries
                                                   in the transmit FIFO is equal to or below this field value,
                                                   and TDMAE = 1.                                                            */
  } b;                                        /*!< bit fields for ssi_dmatdlr */
} ssi_dmatdlr_t, *pssi_dmatdlr_t;

/**
  \brief Union type to access ssi_dmardlr (@ 0x00000054).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000054) DMA Receive Data Level Register                            */
  
  struct {
    __IM  uint32_t            : 7;
    __IOM uint32_t dmardl     : 1;            /*!< [7..7] Receive Data Level. This bit field controls the level
                                                   at which a DMA request is made by the receive logic. The
                                                   watermark level = DMARDL+1; that is, dma_rx_req is generated
                                                   when the number of valid data entries in the receive FIFO
                                                   is equal to or above this field value + 1, and RDMAE=1.                   */
  } b;                                        /*!< bit fields for ssi_dmardlr */
} ssi_dmardlr_t, *pssi_dmardlr_t;

/**
  \brief Union type to access ssi_txuicr (@ 0x00000058).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000058) Transmit FIFO Underflow Interrupt Clear Register           */
  
