apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_ssi_type.h
  struct {
    __IM  uint32_t txuicr     : 1;            /*!< [0..0] Clear Transmit FIFO Underflow Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_txu_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for ssi_txuicr */
} ssi_txuicr_t, *pssi_txuicr_t;

/**
  \brief Union type to access ssi_ssricr (@ 0x0000005C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000005C) SS_N Rising Edge Detect Interrupt Clear Register           */
  
  struct {
    __IM  uint32_t ssiicr     : 1;            /*!< [0..0] Clear SS_N Rinsing Edge Detect Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_ssr_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for ssi_ssricr */
} ssi_ssricr_t, *pssi_ssricr_t;

/**
  \brief Union type to access ssi_dr (@ 0x00000060).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x00000060) Data Register                                              */
  
  struct {
    __IOM uint16_t dr         : 16;           /*!< [15..0] Data register is a 16-bit read/write buffer for the
                                                   transmit/receive FIFOs. When the register is read, data
                                                   in the receive FIFO buffer is accessed. When it is written
                                                   to, data are moved into the transmit FIFO buffer; a write
                                                   can occur only when SSI_EN = 1. FIFOs are reset when SSI_EN
                                                   = 0.When writing to this register, you must right-justify
                                                   the data. Read data are automatically right-justified.
                                                   Read : Receive FIFO buffer Write : Transmit FIFO buffer                   */
  } b;                                        /*!< bit fields for ssi_dr */
} ssi_dr_t, *pssi_dr_t;

/**
  \brief Union type to access ssi_rx_sample_dly (@ 0x000000F0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F0) Rx Sample Delay Register                                   */
  
  struct {
    __IOM uint32_t rsd        : 8;            /*!< [7..0] Receive Data Sample Delay. This register is used to delay
                                                   the sample of the rxd input signal. Each value represents
                                                   a single ssi_clk delay on the sample of the rxd signal.
                                                   If this register is programmed with a value that exceed
                                                   the depth of the internal shift register, a zero delay
                                                   will be applied to the rxd sample.                                        */
  } b;                                        /*!< bit fields for ssi_rx_sample_dly */
} ssi_rx_sample_dly_t, *pssi_rx_sample_dly_t;

/** @} */ /* End of group ls_hal_ssi_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SSI_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_SSI_TYPE_H_

